WELCOME_MESSAGE = '''
Привет! Чем могу служить?
'''

HELP_BUTTON_TEXT = "Помощь 🥺"

EXPLAIN_BUTTON_TEXT = "Что это за бот? 🧐"

ADD_STRINGS_BUTTON_TEXT = "Добавить нитки 🐑"

PROCESS_BUTTON_TEXT = "Обработать изображение 🖼"

HELP_MESSAGE_TEXT = '''
Вот описания команд, которым соответствуют кнопки:\n
\t-> *Обработать изображение* - /process - начало обработки изображения ботом.\n
\t-> *Добавить нитки* - /add - добавить имеющиеся нитки в формате: код цвета в системе Gamma - общая длина ниток в метрах.\n
\t-> *Помощь* - /help - краткий функционал бота.\n
\t-> *Что это за бот?* - /explain - информация о боте. \n
'''

EXPLAIN_MESSAGE_TEXT = '''
Я бот, который трансформирует изображение в схему для вышивания крестиком!\n
Вы можете загрузить сюда любое изображение и получить pdf-файл со схемой.\n
При обработке изображения вам будет предложено ввести длину и ширину вашего холста в крестиках (обязательно посчитайте их).\n
Бот также позволяет указать, какие нитки уже имеются у вас, чтобы использовать эти цвета при составлении схемы, если это возможно. 
При обработке изображения вы сможете задать приоритет использования своих ниток. Не переборщите, а то зеленый цвет может стать красным:)\n
Над проектом работали menella00, Oladiy2504 и disbik!
'''

ADD_STRINGS_MESSAGE_TEXT = '''Укажи данные через пробел в следующем формате:
(код цвета в Gamma) (общая длина в метрах)'''

PROCESS_MESSAGE_TEXT = "Начнем! Введите количество крестиков в длину и ширину через пробел."

BAD_COMMAND_MESSAGE_TEXT = "Команда не найдена. Чтобы ознакомиться со списком команд пропишите /help."

WRONG_FORMAT_MESSAGE = "Неправильный формат ввода! Если вы хотите прекратить ввод - пропишите /stop"

WRONG_DATA_MESSAGE = "Неправильный формат данных! Если вы хотите прекратить ввод - пропишите /stop"

STOP_ADDING_MESSAGE = "Прекращаю добавлять цвета"

PROCESSING_STOP_MESSAGE = "Останавливаю процесс обработки изображения"

USE_STRINGS_Q_MESSAGE = "Теперь скажите, хотите ли вы использовать свои нитки?"

USE_STRINGS_MESSAGE = "Хорошо, будем использовать ваши нитки. Теперь отправьте фотографию."

NO_USE_STRINGS_MESSAGE = "Хорошо, не будем использовать ваши нитки. Теперь отправьте фотографию."

TOO_EARLY_MESSAGE = "Слишком рано прислали изображение :). Выполняйте заполнение данных по команде"

DONE_MESSAGE = "Готово!"

MEME_MESSAGE = "Ой, кажется, вы что-то сделали не так! Вот подробная инструкция по использованию бота: https://youtu.be/dQw4w9WgXcQ?si=1DZGpDS1RDhs-ZJA"